"+ Add" = "+ Lisää";

"Add a card" = "Lisää kortti";

"Add a payment method" = "Lisää maksutapa";

"Add bank account" = "Lisää pankkitili";

"Add new payment method" = "Lisää uusi maksutapa";

"Add your payment information" = "Lisää maksutiedot";

"Approve payment" = "Hyväksy maksu";

"Back" = "Takaisin";

"Bank account" = "Pankkitili";

"Buy now or pay later with Klarna." = "Osta nyt tai maksa myöhemmin Klarnalla.";

"Buy using a UPI ID" = "Osta käyttämällä UPI-tunnusta";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Vahvistamalla maksusi PayPalin kanssa valtuutat %@ veloittamaan tulevia maksuja PayPal-tililtäsi heidän ehtojensa mukaisesti.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Jatkamalla PayPaliin valtuutat %@ veloittamaan tulevia maksuja PayPal-tililtäsi heidän ehtojensa mukaisesti.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Jatkamalla Revolut Payhin valtuutat %@ veloittamaan tulevia maksuja Revolut Pay -tililtäsi heidän ehtojensa mukaisesti.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Jatkamalla hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Jatkamalla valtuutat kauppiaan %1$@ veloittamaan Cash App -tiliäsi tälle ja tuleville maksuille kauppiaan %2$@ ehtojen mukaisesti, kunnes tämä todennus peruutetaan. Voit muuttaa tätä milloin tahansa Cash App -asetuksista.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Liittymällä Linkiin hyväksyt <terms>ehdot</terms> ja <privacy>tietosuojaselosteen</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Antamalla maksutiedot ja vahvistamalla tämän maksun, valtuutat (A) %@ ja Stripen, maksupalvelun tarjoajamme, lähettämään ohjeita pankillesi tilisi veloittamiseksi ja (B) pankkisi veloittamaan tiliäsi annettujen ohjeiden mukaisesti. Oikeuksiesi mukaisesti olet oikeutettu maksun palautukseen pankiltasi heidän kanssaan tekemäsi sopimuksen mukaisesti. Maksun palautus on lunastettava kahdeksan viikon kuluessa tilisi veloituksesta. Oikeutesi kerrotaan lausunnossa, jonka voit hankkia pankiltasi. Hyväksyt vastaanottamaan ilmoituksia tulevista veloituksista kaksi päivää ennen niiden tapahtumista.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Tallentamalla pankkitilisi yritykselle %@, hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Peruuta ja maksa toisella tavalla";

"Choose a payment method" = "Valitse maksutapa";

"Close card scanner" = "Sulje korttiskanneri";

"Confirm" = "Vahvista";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Suorita osto vahvistamalla maksu pankkisi kanssa tai maksusovelluksessa %@.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Suorita osto vahvistamalla maksu pankkisi sovelluksessa %@.";

"Contact information" = "Yhteystiedot";

"EPS Bank" = "EPS-pankki";

"Enter address manually" = "Syötä osoite manuaalisesti";

"FPX Bank" = "FPX-pankki";

"IBAN" = "IBAN";

"Manage your payment methods" = "Hallitse maksutapojasi";

"Name on card" = "Kortissa oleva nimi";

"Open your UPI app to approve your payment within %@" = "Avaa UPI-sovellus ja hyväksy maksu kohteessa %@";

"Or" = "Tai";

"Or pay using" = "Tai käytä maksutapaa";

"Or pay with a card" = "Tai maksa kortilla";

"Pay %@" = "Maksa %@";

"Pay another way" = "Maksa toisella tavalla";

"Pay faster at %@ and thousands of merchants." = "Maksa nopeammin palvelussa %@ ja tuhansilla muilla kauppiailla.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Maksu <num_installments/> korottomassa <installment_price/> osassa maksutavalla <img/>";

"Pay later with Klarna." = "Maksa myöhemmin Klarnalla.";

"Pay over time with %@" = "Maksa aikanaan kohteella %@";

"Pay with Link" = "Maksa Link-palvelulla";

"Pay with your bank account in just a few steps." = "Maksa pankkitiliäsi käyttäen vain muutamassa vaiheessa.";

"Payment failed" = "Maksu epäonnistui";

"Please go back and select another payment method" = "Palaa takaisin ja valitse toinen maksutapa";

"Point the camera at your card." = "Osoita kamera korttia kohti.";

"Processing..." = "Käsitellään...";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove %1$@ ending in %2$@" = "Poista %1$@, joka päättyy numeroihin %2$@";

"Remove Card" = "Poista kortti";

"Save" = "Tallenna";

"Save a new payment method" = "Tallenna uusi maksutapa";

"Save address" = "Tallenna osoite";

"Save for future payments" = "Tallenna tulevia maksuja varten";

"Save my info for secure 1-click checkout" = "Tallenna tietoni turvalliselle yhden napsautuksen maksamiselle";

"Save this account for future %@ payments" = "Tallenna tämä tili tulevia maksuja %@ varten";

"Save this card for future %@ payments" = "Tallenna tämä kortti tulevia maksuja (%@) varten";

"Save your bank account in just a few steps." = "Tallenna pankkitilisi vain muutamassa vaiheessa.";

"Select your payment method" = "Valitse maksutapa";

"Set up" = "Määritä";

"Shipping to %@ is not supported." = "Toimitusta kohteeseen %@ ei tueta.";

"Show menu" = "Näytä valikko";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe tallettaa 0,01 dollaria tilillesi 1–2 arkipäivän kuluessa. Saat myös ohjeet pankkitilisi ja kauppiaan yrityksen %@ tallentamisen suorittamiseksi.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe tallettaa 0,01 dollaria tilillesi 1–2 arkipäivän kuluessa. Saat myös sähköpostiisi ohjeet maksun suorittamiseksi loppuun yritykselle %@.";

"The IBAN you entered is incomplete." = "IBAN on puutteellinen.";

"Update card" = "Päivitä kortti";

"Your IBAN should start with a two-letter country code." = "IBAN-tilinumero alkaa kaksikirjaimisella maakoodilla.";

"iDEAL Bank" = "iDEAL-pankki";
